CHaerem/Glance/esp32-client/src/main.cpp
        // Power down display
        EPD_13IN3E_Sleep();
    }
    else if (command == "enable_streaming")
    {
        sendLogToServer("Serial streaming enable command received");
        enableSerialStreaming();
    }
    else if (command == "disable_streaming")
    {
        sendLogToServer("Serial streaming disable command received");
        disableSerialStreaming();
    }
    else
    {
        sendLogToServer(("Unknown command received: " + command).c_str(), "WARN");
    }
}

// Enhanced communication functions for robustness

bool makeHttpRequest(const String &url, const String &method, const String &payload, String &response, int customTimeout)
{
    int timeout = customTimeout > 0 ? customTimeout : commState.adaptiveTimeout;
    
    for (int attempt = 0; attempt < MAX_RETRY_ATTEMPTS; attempt++)
    {
        HTTPClient http;
        http.begin(url);
        http.setTimeout(timeout);
        http.addHeader("Content-Type", "application/json");
        http.addHeader("User-Agent", "ESP32-Glance-Client/" FIRMWARE_VERSION);
        
        int httpResponseCode;
        if (method == "POST")
        {
            httpResponseCode = http.POST(payload);
        }
        else
        {
            httpResponseCode = http.GET();
        }
        
        if (httpResponseCode == 200 || httpResponseCode == 201)
        {
            response = http.getString();
            http.end();
            updateCommState(true);
            return true;
        }
        else if (httpResponseCode > 0)
        {
            Debug("HTTP request failed with code: " + String(httpResponseCode) + " (attempt " + String(attempt + 1) + ")\r\n");
        }
        else
        {
            Debug("HTTP request failed: " + http.errorToString(httpResponseCode) + " (attempt " + String(attempt + 1) + ")\r\n");
        }
        
        http.end();
        
        if (attempt < MAX_RETRY_ATTEMPTS - 1)
        {
            adaptiveDelay(1000 * (attempt + 1)); // Exponential backoff
        }
    }
    
    updateCommState(false);
    return false;
}

void bufferMessage(const String &endpoint, const String &payload)
{
    if (bufferCount >= OFFLINE_BUFFER_SIZE)
    {
        // Buffer full, remove oldest message
        bufferHead = (bufferHead + 1) % OFFLINE_BUFFER_SIZE;
        bufferCount--;
    }
    
    int index = (bufferHead + bufferCount) % OFFLINE_BUFFER_SIZE;
    offlineBuffer[index].endpoint = endpoint;
    offlineBuffer[index].payload = payload;
    offlineBuffer[index].timestamp = millis();
    offlineBuffer[index].retryCount = 0;
    bufferCount++;
    
    Debug("Message buffered: " + endpoint + " (buffer count: " + String(bufferCount) + ")\r\n");
}

void flushOfflineBuffer()
{
    if (bufferCount == 0) return;
    
    Debug("Flushing offline buffer (" + String(bufferCount) + " messages)...\r\n");
    
    int processed = 0;
    for (int i = 0; i < bufferCount && processed < 5; i++) // Limit to 5 messages per flush to avoid timeout
    {
        int index = (bufferHead + i) % OFFLINE_BUFFER_SIZE;
        BufferedMessage &msg = offlineBuffer[index];
        
        if (msg.retryCount >= MAX_RETRY_ATTEMPTS)
        {
            Debug("Discarding message after max retries: " + msg.endpoint + "\r\n");
            processed++;
            continue;
        }
        
        String response;
        String fullUrl = String(API_BASE_URL) + msg.endpoint;
        
        if (makeHttpRequest(fullUrl, "POST", msg.payload, response, BASE_TIMEOUT))
        {
            Debug("Buffered message sent successfully: " + msg.endpoint + "\r\n");
            processed++;
        }
        else
        {
            msg.retryCount++;
            Debug("Buffered message retry " + String(msg.retryCount) + ": " + msg.endpoint + "\r\n");
            break; // Stop processing if we can't reach server
        }
    }
    
    // Remove processed messages
    if (processed > 0)
    {
        bufferHead = (bufferHead + processed) % OFFLINE_BUFFER_SIZE;
        bufferCount -= processed;
    }
}

void updateCommState(bool success)
{
    if (success)
    {
        commState.lastSuccessfulContact = millis();
        commState.consecutiveFailures = 0;
        commState.serverReachable = true;
        
        // Reduce timeout if we've been having issues
        if (commState.adaptiveTimeout > BASE_TIMEOUT)
        {
            commState.adaptiveTimeout = max(BASE_TIMEOUT, commState.adaptiveTimeout - 1000);
        }
    }
    else
    {
        commState.consecutiveFailures++;
        commState.serverReachable = false;
        
        // Increase timeout for future requests
        commState.adaptiveTimeout = min(MAX_TIMEOUT, commState.adaptiveTimeout + 2000);
        
        Debug("Communication failure #" + String(commState.consecutiveFailures) + 
              ", timeout increased to " + String(commState.adaptiveTimeout) + "ms\r\n");
    }
}

void sendHeartbeat()
{
    if (millis() - commState.lastHeartbeat < HEARTBEAT_INTERVAL)
    {
        return; // Too soon for next heartbeat
    }
    
    float batteryVoltage = readBatteryVoltage();
    int signalStrength = WiFi.RSSI();
    
    DynamicJsonDocument doc(1024);
    doc["deviceId"] = DEVICE_ID;
    
    JsonObject statusObj = doc.createNestedObject("status");
    statusObj["status"] = "heartbeat";
    statusObj["batteryVoltage"] = batteryVoltage;
    statusObj["signalStrength"] = signalStrength;
    statusObj["firmwareVersion"] = FIRMWARE_VERSION;
    statusObj["bootCount"] = bootCount;
    statusObj["freeHeap"] = ESP.getFreeHeap();
    statusObj["uptime"] = millis();
    
    String jsonString;
    serializeJson(doc, jsonString);
    
    String response;
    if (makeHttpRequest(STATUS_URL, "POST", jsonString, response, BASE_TIMEOUT))
    {
        Debug("Heartbeat sent successfully\r\n");
    }
    else
    {
        Debug("Heartbeat failed, buffering...\r\n");
        bufferMessage("device-status", jsonString);
    }
    
    commState.lastHeartbeat = millis();
}

