CHaerem/Glance/esp32-client/src/main.cpp
            // Remove the processed base64 data (approximately 4800 chars for 3600 bytes)
            if (smallBase64Buffer.length() > 4800) {
                smallBase64Buffer = smallBase64Buffer.substring(4800);
            } else {
                smallBase64Buffer = "";
            }
        } else {
            Debug("Row " + String(row) + " decode failed: " + String(decoded) + " bytes\r\n");
            // Remove some data to advance
            if (smallBase64Buffer.length() > 1000) {
                smallBase64Buffer = smallBase64Buffer.substring(800);
            }
        }
        
        // Progress indicator
        if (row % 50 == 0) {
            Debug("Row " + String(row) + ": " + String(decoded) + " bytes decoded\r\n");
            Debug("Free heap: " + String(ESP.getFreeHeap()) + "\r\n");
        }
        
        // Safety check - if we've processed some rows successfully, that's good progress
        if (rowsProcessed >= 10 && !http.connected()) {
            Debug("Connection lost but made progress: " + String(rowsProcessed) + " rows\r\n");
            break;
        }
    }
    
    Debug("Image processing complete: " + String(rowsProcessed) + " rows processed\r\n");
    
    free(rgbBuffer);
    free(einkRowBuffer);
    
    Debug("Streaming image processing completed\r\n");
    Debug("Total image bytes processed: " + String(totalImageBytes) + "\r\n");
    
    return totalImageBytes > 0;
}

// Decode base64 directly into a buffer without creating String objects
int decodeBase64ToBuffer(const String &base64, uint8_t* buffer, int maxSize) {
    const char *chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
    int outputPos = 0;
    
    for (int i = 0; i < base64.length() && outputPos + 3 < maxSize; i += 4) {
        unsigned long combined = 0;
        int validChars = 0;
        
        // Process 4 characters
        for (int j = 0; j < 4 && (i + j) < base64.length(); j++) {
            char c = base64.charAt(i + j);
            if (c == '=') break;
            
            int val = 0;
            if (c >= 'A' && c <= 'Z') {
                val = c - 'A';
            } else if (c >= 'a' && c <= 'z') {
                val = c - 'a' + 26;
            } else if (c >= '0' && c <= '9') {
                val = c - '0' + 52;
            } else if (c == '+') {
                val = 62;
            } else if (c == '/') {
                val = 63;
            }
            
            combined = (combined << 6) | val;
            validChars++;
        }
        
        // Extract bytes
        if (validChars >= 2 && outputPos < maxSize) {
            buffer[outputPos++] = (combined >> 16) & 0xFF;
        }
        if (validChars >= 3 && outputPos < maxSize) {
            buffer[outputPos++] = (combined >> 8) & 0xFF;
        }
        if (validChars >= 4 && outputPos < maxSize) {
            buffer[outputPos++] = combined & 0xFF;
        }
    }
    
    return outputPos;
}

// Display image data with reduced resolution for single refresh
void displayRowData(const uint8_t* rowData, int row, int width) {
    static uint8_t* fullImageBuffer = nullptr;
    static bool allocationAttempted = false;
    static int totalRows = 400; // New resolution: 300×400
    static int imageWidth = 300;
    const int BUFFER_SIZE = (300 * 400) / 2; // 60KB for 4-bit packed data
    
    // Try to allocate full buffer for reduced resolution image
    if (!allocationAttempted) {
        Debug("Attempting to allocate " + String(BUFFER_SIZE/1024) + "KB buffer for 300×400 image...\r\n");
        Debug("Free heap before allocation: " + String(ESP.getFreeHeap()) + " bytes\r\n");
        
        fullImageBuffer = (uint8_t*)malloc(BUFFER_SIZE);
        if (fullImageBuffer != nullptr) {
            Debug("SUCCESS: Full image buffer allocated! Will use single refresh.\r\n");
            // Clear the buffer
            memset(fullImageBuffer, 0x11, BUFFER_SIZE); // Fill with white
        } else {
            Debug("FAILED: Cannot allocate " + String(BUFFER_SIZE/1024) + "KB buffer (60KB).\r\n");
        }
        allocationAttempted = true;
        Debug("Free heap after allocation: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    }
    
    if (row % 100 == 0) {
        Debug("Processing row " + String(row) + " / " + String(totalRows) + "\r\n"); 
        Debug("Free heap: " + String(ESP.getFreeHeap()) + "\r\n");
    }
    
    if (fullImageBuffer != nullptr && row < totalRows) {
        // Store row in full buffer
        int rowSize = imageWidth / 2; // 4-bit packed, so 500/2 = 250 bytes per row
        if (row * rowSize + rowSize <= BUFFER_SIZE) {
            memcpy(fullImageBuffer + (row * rowSize), rowData, rowSize);
        }
        
        // On final row: display entire image with single refresh
        if (row >= totalRows - 1) {
            Debug("All rows buffered - displaying with SINGLE refresh...\r\n");
            Debug("Image size: " + String(imageWidth) + "×" + String(totalRows) + "\r\n");
            
            // Use EPD_13IN3E_Display for single refresh (but need to adjust for smaller image)
            // For now, just use DisplayPart to show the image centered
            int xOffset = (1200 - imageWidth) / 2; // Center horizontally
            int yOffset = (1600 - totalRows) / 2;  // Center vertically
            
            EPD_13IN3E_DisplayPart(fullImageBuffer, xOffset, yOffset, imageWidth, totalRows);
            
            Debug("Single refresh complete! Image displayed.\r\n");
            
            free(fullImageBuffer);
            fullImageBuffer = nullptr;
            allocationAttempted = false;
        }
    } else {
        // Fallback if allocation failed
        Debug("Using fallback display for row " + String(row) + "\r\n");
        EPD_13IN3E_DisplayPart(rowData, 0, row, width, 1);
        
        if (row >= totalRows - 1) {
            Debug("Fallback display complete.\r\n");
            allocationAttempted = false;
        }
    }
}